## PANDAS(Python Data Analysis Library)

In [ ]:
import pandas as pd

df = pd.read_csv('exam.csv')

In [ ]:
df

        Name  Quiz 1  Quiz 2  Midterm  Quiz 3  Final  Participation
0  Student A     4.0     4.0       18     3.0     19              5
1  Student B     3.5     3.0       15     3.5     16              5
2  Student C     5.0     5.0       19     4.0     17              5
3  Student D     2.5     2.5       12     3.0     10              3

In [ ]:
df['Name']

0    Student A
1    Student B
2    Student C
3    Student D
Name: Name, dtype: object

In [ ]:
df.Midterm

0    18
1    15
2    19
3    12
Name: Midterm, dtype: int64

In [ ]:
df['Quiz 1']

0    4.0
1    3.5
2    5.0
3    2.5
Name: Quiz 1, dtype: float64

In [ ]:
df[['Name','Final']]

        Name  Final
0  Student A     19
1  Student B     16
2  Student C     17
3  Student D     10

In [ ]:
df1 = df[['Name','Final']]

df1

        Name  Final
0  Student A     19
1  Student B     16
2  Student C     17
3  Student D     10

In [ ]:
df1.Final.min()

10

In [ ]:
df['Midterm'].max()

19

In [ ]:
df

        Name  Quiz 1  Quiz 2  Midterm  Quiz 3  Final  Participation
0  Student A     4.0     4.0       18     3.0     19              5
1  Student B     3.5     3.0       15     3.5     16              5
2  Student C     5.0     5.0       19     4.0     17              5
3  Student D     2.5     2.5       12     3.0     10              3

In [ ]:
df.mean()

Quiz 1            3.750
Quiz 2            3.625
Midterm          16.000
Quiz 3            3.375
Final            15.500
Participation     4.500
dtype: float64

In [ ]:
df.sum() #รวมในแนวตั้ง

Name             Student AStudent BStudent CStudent D
Quiz 1                                             15
Quiz 2                                           14.5
Midterm                                            64
Quiz 3                                           13.5
Final                                              62
Participation                                      18
dtype: object

In [ ]:
df.sum(axis=1)

0    53.0
1    46.0
2    55.0
3    33.0
dtype: float64

In [ ]:
df['Sum'] = df.sum(axis=1)

In [ ]:
df

        Name  Quiz 1  Quiz 2  Midterm  Quiz 3  Final  Participation   Sum
0  Student A     4.0     4.0       18     3.0     19              5  53.0
1  Student B     3.5     3.0       15     3.5     16              5  46.0
2  Student C     5.0     5.0       19     4.0     17              5  55.0
3  Student D     2.5     2.5       12     3.0     10              3  33.0

In [ ]:
# Export file
df.to_csv('out.csv')